online_benchmark_log/mi35x/DeepSeek-R1-MXFP4-Preview/v0.5.4.post1-rocm700-mi35x-20251030_DeepSeek-R1-MXFP4-Preview_FP8_online_mtp_test/sglang_serving_benchmark_concurrency_1_run1_20251030_190221.log
Run started at: 2025-10-30 19:02:21 PDT
Using 128 prompts for concurrency 1
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='random', dataset_path='', model=None, tokenizer=None, num_prompts=128, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=3200, random_output_len=800, random_range_ratio=1.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=1, output_file=None, output_details=False, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='random', dataset_path='', model='/mnt/raid/models/deepseek-ai/amd-DeepSeek-R1-MXFP4-Preview', tokenizer=None, num_prompts=128, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=3200, random_output_len=800, random_range_ratio=1.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=1, output_file=None, output_details=False, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)

#Input tokens: 409600
#Output tokens: 102400
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 128/128 [1:08:29<00:00, 32.10s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 1         
Successful requests:                     128       
Benchmark duration (s):                  4109.39   
Total input tokens:                      409600    
Total input text tokens:                 409600    
Total input vision tokens:               0         
Total generated tokens:                  102400    
Total generated tokens (retokenized):    101906    
Request throughput (req/s):              0.03      
Input token throughput (tok/s):          99.67     
Output token throughput (tok/s):         24.92     
Total token throughput (tok/s):          124.59    
Concurrency:                             1.00      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   32103.58  
Median E2E Latency (ms):                 32148.96  
---------------Time to First Token----------------
Mean TTFT (ms):                          147.92    
Median TTFT (ms):                        138.13    
P99 TTFT (ms):                           251.81    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           40.00     
Median ITL (ms):                         35.35     
P95 ITL (ms):                            57.72     
P99 ITL (ms):                            162.54    
Max ITL (ms):                            636.32    
==================================================
Run completed at: 2025-10-30 20:11:01 PDT
Run duration: 4120 seconds